tests/Zenith/assert/client/request2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:ZenithService" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:execute><service xsi:type="ns1:Service"><class xsi:type="xsd:string">Acme/HelloWorld</class><method xsi:type="xsd:string">hello</method></service><configuration xsi:type="ns1:Configuration"><option xsi:type="ns1:Option"><name xsi:type="xsd:string">test</name><value xsi:type="xsd:string">value</value></option></configuration><parameter xsi:type="ns1:Parameter"></parameter></ns1:execute></SOAP-ENV:Body></SOAP-ENV:Envelope>
